src/cf/Catalogs/ВидыЗаказовПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗаказовПокупателей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостоянияЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДоставлен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОжидаетОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеОтгружен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПорядокСостояний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыЗаказовПокупателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Основной";
	Элемент.Наименование = НСтр("ru='Основной'");
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНастройкеНачальногоЗаполненияЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Процедура заполняет основной вид заказа. Должна вызываться после заполнения справочника состояний.
//
Процедура ЗаполнитьОсновнойВидЗаказа() Экспорт
	
	ВидЗаказа = Основной.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияЗаказовПокупателей.Ссылка КАК Состояние,
		|	ВЫБОР
		|		КОГДА СостоянияЗаказовПокупателей.Наименование = &Состояние1
		|			ТОГДА 1
		|		КОГДА СостоянияЗаказовПокупателей.Наименование = &Состояние2
		|			ТОГДА 2
		|		КОГДА СостоянияЗаказовПокупателей.Наименование = &Состояние3
		|			ТОГДА 3
		|		КОГДА СостоянияЗаказовПокупателей.Наименование = &Состояние4
		|			ТОГДА 4
		|		ИНАЧЕ 5
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.СостоянияЗаказовПокупателей КАК СостоянияЗаказовПокупателей
		|ГДЕ
		|	СостоянияЗаказовПокупателей.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	Запрос.УстановитьПараметр("Состояние1", СостоянияЗаказов.СостояниеНеОбработан());
	Запрос.УстановитьПараметр("Состояние2", СостоянияЗаказов.СостояниеВРаботе());
	Запрос.УстановитьПараметр("Состояние3", СостоянияЗаказов.СостояниеВыставленСчет());
	Запрос.УстановитьПараметр("Состояние4", СостоянияЗаказов.СостояниеНаВыполнении());
	
	Состояния = Запрос.Выполнить().Выгрузить();
	
	ВидЗаказа.ПорядокСостояний.Загрузить(Состояния);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидЗаказа);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	КоличествоЭлементовБыстрогоВыбора = 15;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 99
		|	ВидыЗаказовПокупателей.Ссылка КАК ВидЗаказа,
		|	ВидыЗаказовПокупателей.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
		|ГДЕ
		|	ВидыЗаказовПокупателей.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "99", КоличествоЭлементовБыстрогоВыбора);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеВыбора.Добавить(Выборка.ВидЗаказа, Выборка.Наименование);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Первое состояние после заявки.
// 
// Параметры:
//  Ссылка - СправочникСсылка.ВидыЗаказовПокупателей - Вид заказа
// 
// Возвращаемое значение:
//  СправочникСсылка.СостоянияЗаказовПокупателей - Первое состояние после заявки
Функция ПервоеСостояниеПослеЗаявки(Ссылка) Экспорт
	
	НомерСостоянияЗаявки = НомерСостоянияЗаявки(Ссылка);
	Если НомерСостоянияЗаявки = 0 Тогда
		Возврат ПервоеСостояние(Ссылка);
	КонецЕсли;
	
	Возврат СостояниеПоНомеруСтроки(НомерСостоянияЗаявки + 1, Ссылка);
	
КонецФункции

// Это состояние заявки.
// 
// Параметры:
//  Состояние - СправочникСсылка.СостоянияЗаказовПокупателей - Состояние
//  Ссылка - СправочникСсылка.ВидыЗаказовПокупателей - Вид заказа
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийЗаказПокупателя, Неопределено - Вид операции
// 
// Возвращаемое значение:
//  Булево - Это состояние заявки
Функция ЭтоСостояниеЗаявки(Состояние, Ссылка, ВидОперации = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВидОперации)
		И ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу
		И Состояние = Справочники.СостоянияЗаказовПокупателей.Завершен Тогда
		Возврат Истина;
	КонецЕсли;
	
	НомерСостоянияЗаявки = НомерСостоянияЗаявки(Ссылка);
	Если НомерСостоянияЗаявки = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НомерСтрокиСостояния = НомерСтрокиСостояния(Состояние, Ссылка);
	Если НомерСтрокиСостояния = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат НомерСтрокиСостояния <= НомерСостоянияЗаявки;
	
КонецФункции

Функция ПервоеСостояние(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.СостоянияЗаказовПокупателей.Завершен;
	КонецЕсли;
	
	Возврат Выборка.Состояние;
	
КонецФункции

Функция ВсеСостоянияЗаявки(Ссылка) Экспорт
	
	ДанныеСостоянияЗаявки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СостояниеЗаявки,НомерСостоянияЗаявки");
	Если Не ЗначениеЗаполнено(ДанныеСостоянияЗаявки.СостояниеЗаявки) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Результат = ПредыдущиеСостояния(Ссылка, ДанныеСостоянияЗаявки.НомерСостоянияЗаявки);
	Результат.Добавить(ДанныеСостоянияЗаявки.СостояниеЗаявки);
	
	Возврат Результат;
	
КонецФункции

Функция ВсеСостоянияЗаказа(Ссылка) Экспорт
	
	НомерСостоянияЗаявки = НомерСостоянияЗаявки(Ссылка);
	Если НомерСостоянияЗаявки = 0 Тогда
		Возврат ВсеСостояния(Ссылка);
	КонецЕсли;
	
	Возврат СледующиеСостояния(Ссылка, НомерСостоянияЗаявки);
	
КонецФункции

Функция ВидЗаказаСЗаявками() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателей.Ссылка КАК Ссылка,
		|	ВидыЗаказовПокупателей.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЗаказовПокупателей.Основной) КАК ЭтоОсновной
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
		|ГДЕ
		|	ВидыЗаказовПокупателей.СостояниеЗаявки <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СостояниеЗаявки = Неопределено;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если СостояниеЗаявки = Неопределено Тогда
			СостояниеЗаявки = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.ЭтоОсновной Тогда
			Возврат Основной;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СостояниеЗаявки;
	
КонецФункции

Функция ЕстьВидСВключеннымиЗаявками() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗаказовПокупателей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
		|ГДЕ
		|	ВидыЗаказовПокупателей.СостояниеЗаявки <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовПокупателей.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПоследнийИспользованныйДоступныйВидЗаказа(ВидОперации, СостояниеЗаказа = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
		Возврат Основной;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СостояниеЗаказа) Тогда
		Возврат ПоследнийИспользованныйДоступныйВидЗаказаПоСостоянию(СостояниеЗаказа, ВидОперации);
	Иначе
		Возврат ПоследнийИспользованныйДоступныйВидЗаказаБезСостояния(ВидОперации);
	КонецЕсли;
	
КонецФункции

Функция ВидСодержитСостояние(Ссылка, СостояниеЗаказа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние = &Состояние
		|	И ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Состояние", СостояниеЗаказа);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Функция КоличествоСостояний(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыЗаказовПокупателейПорядокСостояний.Ссылка) КАК КоличествоСостояний
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоСостояний;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция НомерСостояния(ПорядокСостояний, Состояние) Экспорт
	
	СтрокаСостояния = ПорядокСостояний.Найти(Состояние);
	Если ЗначениеЗаполнено(СтрокаСостояния) Тогда
		Возврат СтрокаСостояния.НомерСтроки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ВидыЗаказовГдеСостояниеИспользуетЗаявки(СостояниеЗаказа) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка КАК Ссылка,
		|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втНомераСостояния
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние = &Состояние
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗаказовПокупателей.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВидыЗаказовПокупателей.Ссылка) КАК Представление
		|ИЗ
		|	втНомераСостояния КАК втНомераСостояния
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗаказовПокупателей КАК ВидыЗаказовПокупателей
		|		ПО втНомераСостояния.Ссылка = ВидыЗаказовПокупателей.Ссылка
		|ГДЕ
		|	втНомераСостояния.НомерСтроки <= ВидыЗаказовПокупателей.НомерСостоянияЗаявки";
	
	Запрос.УстановитьПараметр("Состояние", СостояниеЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные = Новый Структура("Ссылка,Представление");
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
		Результат.Добавить(Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоследнийИспользованныйДоступныйВидЗаказаПоСостоянию(СостояниеЗаказа, ВидОперации)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка КАК Ссылка,
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыЗаказовПокупателей.Основной) КАК
		|		ЭтоОсновнойВид
		|ПОМЕСТИТЬ втНомераСтрокиСостояния
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние = &СостояниеЗаказа
		|	И
		|		ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаказПокупателя.ВидЗаказа КАК ВидЗаказа,
		|	ЗаказПокупателя.Дата КАК Дата
		|ИЗ
		|	втНомераСтрокиСостояния КАК втНомераСтрокиСостояния
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО втНомераСтрокиСостояния.Ссылка = ЗаказПокупателя.ВидЗаказа
		|ГДЕ
		|	ЗаказПокупателя.Автор = &Автор
		|	И ЗаказПокупателя.ВидЗаказа = втНомераСтрокиСостояния.Ссылка
		|	И (ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаказПокупателя.ВидЗаказа,
		|	ЗаказПокупателя.Дата
		|ИЗ
		|	втНомераСтрокиСостояния КАК втНомераСтрокиСостояния
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО втНомераСтрокиСостояния.Ссылка = ЗаказПокупателя.ВидЗаказа
		|ГДЕ
		|	ЗаказПокупателя.ВидЗаказа = втНомераСтрокиСостояния.Ссылка
		|	И (ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Если Не ЕстьВидСВключеннымиЗаявками() Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки",
		"");
		
	ИначеЕсли РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(ВидОперации) Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки",
		"И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки <= ВидыЗаказовПокупателейПорядокСостояний.Ссылка.НомерСостоянияЗаявки");
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"И (ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку))",
		"И ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу)");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СостояниеЗаказа", СостояниеЗаказа);
	Запрос.УстановитьПараметр("Автор", Пользователи.ТекущийПользователь());
	
	ПакетЗапросов = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Выборка = ПакетЗапросов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЗаказа;
	КонецЕсли;
	
	Выборка = ПакетЗапросов[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЗаказа;
	КонецЕсли;
	
	Таблица = ПакетЗапросов[0].Выгрузить();
	Для Каждого СтрокаТЗ Из Таблица Цикл
		Если СтрокаТЗ.ЭтоОсновнойВид Тогда
			Возврат СтрокаТЗ.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Если Таблица.Количество() Тогда
		Возврат Таблица[0].Ссылка;
	КонецЕсли;
	
	Возврат Основной;
	
КонецФункции

Функция ПоследнийИспользованныйДоступныйВидЗаказаБезСостояния(ВидОперации)
	
	ЭтоЗаявка = РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(ВидОперации);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаказПокупателя.ВидЗаказа КАК ВидЗаказа,
		|	ЗаказПокупателя.Дата КАК Дата
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Автор = &Автор
		|	И ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗаказПокупателя.ВидЗаказа,
		|	ЗаказПокупателя.Дата
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	Если ЭтоЗаявка Тогда
		
		ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу)
		|			ИЛИ ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку)",
		"ЗаказПокупателя.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаказПокупателя.ЗаявкаНаПродажу)");
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Автор", Пользователи.ТекущийПользователь());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Выборка = ПакетЗапросов[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЗаказа;
	КонецЕсли;
	
	Выборка = ПакетЗапросов[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидЗаказа;
	КонецЕсли;
	
	Если ЭтоЗаявка Тогда
		Возврат ВидЗаказаСЗаявками();
	КонецЕсли;
	
	Возврат Основной;
	
КонецФункции

Функция НомерСостоянияЗаявки(Ссылка)
	
	Номер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерСостоянияЗаявки");
	Если Не ЗначениеЗаполнено(Номер) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Номер;
	
КонецФункции

Функция НомерСтрокиСостояния(Состояние, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка
		|	И ВидыЗаказовПокупателейПорядокСостояний.Состояние = &Состояние";
	Запрос.УстановитьПараметр("Состояние", Состояние);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Выборка.НомерСтроки;
	
КонецФункции

Функция ПредыдущиеСостояния(Ссылка, НомерСтроки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка
		|	И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки < &НомерСтроки";
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Состояние);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВсеСостояния(Ссылка)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Состояние);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СледующиеСостояния(Ссылка, НомерСтроки)
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка
		|	И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки > &НомерСтроки";
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Состояние);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СостояниеПоНомеруСтроки(НомерСтроки, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗаказовПокупателейПорядокСостояний.Состояние КАК Состояние
		|ИЗ
		|	Справочник.ВидыЗаказовПокупателей.ПорядокСостояний КАК ВидыЗаказовПокупателейПорядокСостояний
		|ГДЕ
		|	ВидыЗаказовПокупателейПорядокСостояний.Ссылка = &Ссылка
		|	И ВидыЗаказовПокупателейПорядокСостояний.НомерСтроки = &НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.СостоянияЗаказовПокупателей.Завершен;
	КонецЕсли;
	
	Возврат Выборка.Состояние;
	
КонецФункции

#КонецОбласти

#КонецЕсли
